/******************** LQ_K60_函数库 v1.0 ********************
 * 文件名           ：LQKEY.c
 * 功能             ：初始化按键
 * 备注             ：官方例程上修改
 * 日期             ：2016-09-01
 * 实验平台         ：龙丘 K60VG核心板 
 * 开发环境         ：IAR 7.3
 * 作者             ：龙丘技术 006
 * 淘宝店           ：https://longqiu.taobao.com
 * 龙丘智能车讨论群 ：202949437
*************************************************************/

#include "include.h"
#include "key.h"

//-------------------------------------------------------------------------*
//函数名: KEY_Init（）                                                      *
//功  能: 初始化IO口                                                      * 
//参  数:                                                                *
//返  回: 无                                                              *
//简  例: KEY_Init（）                                                     *
//-------------------------------------------------------- -----------------*
void KEY_Init(void)
{
   gpio_init(PTB20,  GPI,1);
   gpio_init(PTB21,  GPI,1);
   gpio_init(PTB22,  GPI,1);
      
}

//-------------------------------------------------------------------------*
//函数名: KEY_Read（）                                                      *
//功  能: 读取按键值                                                       * 
//参  数:                                                                *
//返  回:                                                              *
//简  例: KEY_Read( KEY0)                                                *
//-------------------------------------------------------------------------*
unsigned char KEY_Read(KEYn_e keyno)
{
    switch(keyno) 
    {
      case KEY0:
        return gpio_get(PTB20);
      break;
      
      case KEY1:
        return gpio_get(PTB21);
      break;
      
      case KEY2:
        return gpio_get(PTB22);
      break;
      default:
        return 0XFF;
           
    }
}


